import screen_1 from '../img/rules-page/screen_1.jpg';
import screen_2 from '../img/rules-page/screen_2.jpg';
import screen_3 from '../img/rules-page/screen_3.png';
import screen_4 from '../img/rules-page/screen_4.png';
import screen_5 from '../img/rules-page/screen_5.jpg';
import screen_6 from '../img/rules-page/screen_6.jpg';
import screen_7 from '../img/rules-page/screen_7.jpg';
import screen_8 from '../img/rules-page/screen_8.jpg';


export const rulesInfo = [
    {
        title:'Загальні правила гри.',
        items:[
            {
                info:'«Сапер» – це нескладна гра, що розвиває увагу, пам’ять і логіку. Мета – відкрити всі комірки на полі так, щоб не "підірвати" ні одну міну. Для пошуку вибухонебезпечних квадратиків можна використовувати підказки: Числа в клітинках показують кількість мін, прихованих у поруч клітинках. Якщо біля відкритої осередку є порожні клітинки, вони відкриються автоматично. Якщо ви розумієте, що в якійсь клітинці ховається бомба, позначте її прапорцем.🚩 Коли ви відкриєте клітинку з міною, гра закінчується поразкою.Для перемоги в грі потрібно відкрити всі комірки на полі, позначивши всі клітинки з бомбою прапорцем.🚩',
                image:screen_1,
            },
            {
                info:'Партія починається після першої відкритої осередку. Вибір першої клітинки неважливий – це робиться навмання, довірившись своїй удачі. Зазвичай відкривається порожнє поле. Якщо поруч розташовані кілька вільних клітин, будуть відкриті одночасно. Важче грати, якщо порожня виявилася всього 1 клітинка. У цій ситуації треба знову відкривати навмання, при цьому є ризик потрапити на міну.',
                image:screen_5,
            },
            {
                info:'Числові значення на клітинах вказують на кількість бомб в сусідніх. За допомогою цих підказок можна визначити, де розташовані міни: число 1 вказує, що з клітин зверху, зліва, знизу, праворуч і по діагоналі від відкритою лише одна містить пастку. Навколо осередків з числом 2 знаходиться 2 бомби, з числом 3, і так далі. Якщо цифра у відкритій клітці відсутній, навколо розташовуються лише порожні. Крім чисел, у комірці може розташовуватися міна. Якщо комірка з подібним символом буде розкрита, партія завершиться.',
                image:screen_6,
            },
            {
                info:'Як позначити міни? Коли гравець визначив, що в клітці розташовується пастка, він може помітити її за допомогою прапорця 🚩. Щоб зробити це, потрібно натиснути правою кнопкою мишки або довгий натиск на мобільному. Прапорцем позначайте комірки з міною. Коли розташування визначиться, можна натискати на імовірно порожні клітини. Якщо клітка була виділена випадково, а гравець виявив свою помилку, зняти позначку можна повторним клацанням по прапорцю правою кнопкою  миші або довгий натиск на мобільному.  Чи можливо відкрити всі комірки? Залишилися осередки відкриваються за тим же принципом. Потрібно уважно вивчати кількість пасток в сусідніх клітинах, позначати їх, після чого розкривати вільні. Якщо гравець не зробить помилок з визначенням положення, він легко зможе знайти все пусті клітинки і відкрити їх.',
                image:screen_7,
            },
            {
                info:'На простих рівнях для проходження часто достатньо логічного мислення і дедукції. У складних ситуаціях доводиться розраховувати ймовірності знаходження вибухонебезпечних елементів на спірних клітинках Іноді логіка не допомагає вирішити головоломку, доводиться розкривати клітинку навмання. У таких ситуаціях лише везіння допоможе перемогти. Якщо не вдається з допомогою логіки з’ясувати, де знаходиться пастка, краще приймати рішення швидко, щоб заощадити час. Необхідність діяти навмання може виникнути на самому складному рівні або на особливому. На простому і середньому таке утруднення не виникне: при правильно підібраної тактики гравець завжди здатний виграти партію.',
                image:screen_8,
            }
        ],
   
    },
    {
        title:'Як почати гру?',
        items:[
            {
                info:'1. На головній сторінці - натисніть кнопку "Oбери регіон та почни гру!" або перейди на сторінку "Почати гру"',
                image: screen_2,
            },
            {
                info:'2. На сторінці налаштувань - оберіть регіон для розмінування або "Власні налаштування". Кожен регіон визначає складність гри.',
                image: screen_3,
            },
            {
                info:'3. На сторінці гри - є додаткові налаштування: Сторінка регіону - має налаштування розміру клітинки. Сторінка "Власні налаштування" - додатково має налаштування: Сладність гри, Кількість колонок та строк.',
                image: screen_4,
            },
            {
                info:'Вдалого розмінування!',
 
            },
        ],
   
    },
    {
        title:'Керування.',
        items:[
            {
                info:'1. "Клік лівою кнопкою миші" або "Клік" на мобільному - Відкривае клітинку.',
            },
            {
                info:'2. "Клік правою кнопкою миші" або "Подовжений натиск" на мобільному - Встановлює або прибирає прапорець.🚩',
            },
            {
                info:'3. "Подвійний Клік лівою кнопкою миші" на клітинку з цифрою або "Подвійний Клік" на мобільному на клітинку з цифрою - Відкриває сусідні клітинки з такоюж цифрою.',
            },
        ],
   
    },  
    {
        title:'Як навчитися грати в "Сапера"?',
        items:[
            {
                info:"Кращий спосіб, як навчитися грати в 'Сапера' – пробувати спочатку легкий рівень. Не варто відразу переходити до великого поля.  На етапі навчання поспіх лише завадить, підвищить ймовірність помилки і поразки. ",
            },
            {
                info:"Послідовність навчання: Навчитися розуміти цифрові підказки, щоб при погляді на цифри розуміти, де може перебувати міна. Навчитися швидко визначати зайняті позиції у відповідності з цифровими підказками. Намагатися покращувати свої показники, вирішувати головоломку швидше. Оскільки право на помилку в цій комп’ютерній грі не передбачено, рекомендується заздалегідь уважно перевірити правильність своїх розрахунків, тільки після цього відкривати клітинку.",
            },
            {
                info:"Корисні поради від гравців Досвідчені любителі гри із задоволенням діляться секретами з початківцями гравцями: У найпростішому рівні відсутні вибухонебезпечні елементи в кутах ігрового поля. Якщо виникли труднощі, можна відкрити кутові клітини і почати розрахунки з урахуванням отриманої інформації.Простіше грати, якщо відразу було розкрите велике поле, а не відкрита одиночна клітина. Деякі гравці вважають за краще кілька разів починати спочатку, щоб розкрити великі порожнечі з першого кліка.",
            },
            {
                info:"Спростити завдання допоможе підрахунок знайдених мін. Така дія допоможе з’ясувати, скільки пасток ще залишилося на полі. Після можна буде підрахувати ймовірність знаходження вибухового пристрою на кожній із закритих клітин. Просунуті гравці нерідко використовують цю тактику в кінці ігрового процесу, коли спірних комірок залишається мало.",
            },
            {
                info:"Найпростіше знайти вибуховий пристрій біля клітки з цифрою 1. Коли таке буде виявлено, легше буде відшукати міни та у сусідніх клітин з великими числовими значеннями. Крім того, можна буде відкрити всі інші прилеглі до одиниці осередку. Міни на них точно не опиниться. ",
            },
            {
                info:"Якщо перед гравцем постає вибір – відкрити навмання випадкову клітинку або ненадовго відкласти непростий ділянку, краще почекати деякий час. Коли виявиться розкрито більше порожніх позицій, знайдено більше мін, легше буде виявити, що залишилися.",
            },
            {
                info:"Зрозуміти як грати в “сапера” не складно, достатньо розібратися в простих правилах. А надалі все залежить від вашої посидючості, уважності і дещиці везіння. Все ж дуже багато залежить від випала комбінації і першого ходу.",
            },
        ],
   
    },  
]
